frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/instance/pdca.h
#define REG_PDCA_PSR2              (*(RwReg  *)0x400A2084UL) /**< \brief (PDCA) Peripheral Select Register 2 */
#define REG_PDCA_TCR2              (*(RwReg  *)0x400A2088UL) /**< \brief (PDCA) Transfer Counter Register 2 */
#define REG_PDCA_MARR2             (*(RwReg  *)0x400A208CUL) /**< \brief (PDCA) Memory Address Reload Register 2 */
#define REG_PDCA_TCRR2             (*(RwReg  *)0x400A2090UL) /**< \brief (PDCA) Transfer Counter Reload Register 2 */
#define REG_PDCA_CR2               (*(WoReg  *)0x400A2094UL) /**< \brief (PDCA) Control Register 2 */
#define REG_PDCA_MR2               (*(RwReg  *)0x400A2098UL) /**< \brief (PDCA) Mode Register 2 */
#define REG_PDCA_SR2               (*(RoReg  *)0x400A209CUL) /**< \brief (PDCA) Status Register 2 */
#define REG_PDCA_IER2              (*(WoReg  *)0x400A20A0UL) /**< \brief (PDCA) Interrupt Enable Register 2 */
#define REG_PDCA_IDR2              (*(WoReg  *)0x400A20A4UL) /**< \brief (PDCA) Interrupt Disable Register 2 */
#define REG_PDCA_IMR2              (*(RoReg  *)0x400A20A8UL) /**< \brief (PDCA) Interrupt Mask Register 2 */
#define REG_PDCA_ISR2              (*(RoReg  *)0x400A20ACUL) /**< \brief (PDCA) Interrupt Status Register 2 */
#define REG_PDCA_MAR3              (*(RwReg  *)0x400A20C0UL) /**< \brief (PDCA) Memory Address Register 3 */
#define REG_PDCA_PSR3              (*(RwReg  *)0x400A20C4UL) /**< \brief (PDCA) Peripheral Select Register 3 */
#define REG_PDCA_TCR3              (*(RwReg  *)0x400A20C8UL) /**< \brief (PDCA) Transfer Counter Register 3 */
#define REG_PDCA_MARR3             (*(RwReg  *)0x400A20CCUL) /**< \brief (PDCA) Memory Address Reload Register 3 */
#define REG_PDCA_TCRR3             (*(RwReg  *)0x400A20D0UL) /**< \brief (PDCA) Transfer Counter Reload Register 3 */
#define REG_PDCA_CR3               (*(WoReg  *)0x400A20D4UL) /**< \brief (PDCA) Control Register 3 */
#define REG_PDCA_MR3               (*(RwReg  *)0x400A20D8UL) /**< \brief (PDCA) Mode Register 3 */
#define REG_PDCA_SR3               (*(RoReg  *)0x400A20DCUL) /**< \brief (PDCA) Status Register 3 */
#define REG_PDCA_IER3              (*(WoReg  *)0x400A20E0UL) /**< \brief (PDCA) Interrupt Enable Register 3 */
#define REG_PDCA_IDR3              (*(WoReg  *)0x400A20E4UL) /**< \brief (PDCA) Interrupt Disable Register 3 */
#define REG_PDCA_IMR3              (*(RoReg  *)0x400A20E8UL) /**< \brief (PDCA) Interrupt Mask Register 3 */
#define REG_PDCA_ISR3              (*(RoReg  *)0x400A20ECUL) /**< \brief (PDCA) Interrupt Status Register 3 */
#define REG_PDCA_MAR4              (*(RwReg  *)0x400A2100UL) /**< \brief (PDCA) Memory Address Register 4 */
#define REG_PDCA_PSR4              (*(RwReg  *)0x400A2104UL) /**< \brief (PDCA) Peripheral Select Register 4 */
#define REG_PDCA_TCR4              (*(RwReg  *)0x400A2108UL) /**< \brief (PDCA) Transfer Counter Register 4 */
#define REG_PDCA_MARR4             (*(RwReg  *)0x400A210CUL) /**< \brief (PDCA) Memory Address Reload Register 4 */
#define REG_PDCA_TCRR4             (*(RwReg  *)0x400A2110UL) /**< \brief (PDCA) Transfer Counter Reload Register 4 */
#define REG_PDCA_CR4               (*(WoReg  *)0x400A2114UL) /**< \brief (PDCA) Control Register 4 */
#define REG_PDCA_MR4               (*(RwReg  *)0x400A2118UL) /**< \brief (PDCA) Mode Register 4 */
#define REG_PDCA_SR4               (*(RoReg  *)0x400A211CUL) /**< \brief (PDCA) Status Register 4 */
#define REG_PDCA_IER4              (*(WoReg  *)0x400A2120UL) /**< \brief (PDCA) Interrupt Enable Register 4 */
#define REG_PDCA_IDR4              (*(WoReg  *)0x400A2124UL) /**< \brief (PDCA) Interrupt Disable Register 4 */
#define REG_PDCA_IMR4              (*(RoReg  *)0x400A2128UL) /**< \brief (PDCA) Interrupt Mask Register 4 */
#define REG_PDCA_ISR4              (*(RoReg  *)0x400A212CUL) /**< \brief (PDCA) Interrupt Status Register 4 */
#define REG_PDCA_MAR5              (*(RwReg  *)0x400A2140UL) /**< \brief (PDCA) Memory Address Register 5 */
#define REG_PDCA_PSR5              (*(RwReg  *)0x400A2144UL) /**< \brief (PDCA) Peripheral Select Register 5 */
#define REG_PDCA_TCR5              (*(RwReg  *)0x400A2148UL) /**< \brief (PDCA) Transfer Counter Register 5 */
#define REG_PDCA_MARR5             (*(RwReg  *)0x400A214CUL) /**< \brief (PDCA) Memory Address Reload Register 5 */
#define REG_PDCA_TCRR5             (*(RwReg  *)0x400A2150UL) /**< \brief (PDCA) Transfer Counter Reload Register 5 */
#define REG_PDCA_CR5               (*(WoReg  *)0x400A2154UL) /**< \brief (PDCA) Control Register 5 */
#define REG_PDCA_MR5               (*(RwReg  *)0x400A2158UL) /**< \brief (PDCA) Mode Register 5 */
#define REG_PDCA_SR5               (*(RoReg  *)0x400A215CUL) /**< \brief (PDCA) Status Register 5 */
#define REG_PDCA_IER5              (*(WoReg  *)0x400A2160UL) /**< \brief (PDCA) Interrupt Enable Register 5 */
#define REG_PDCA_IDR5              (*(WoReg  *)0x400A2164UL) /**< \brief (PDCA) Interrupt Disable Register 5 */
#define REG_PDCA_IMR5              (*(RoReg  *)0x400A2168UL) /**< \brief (PDCA) Interrupt Mask Register 5 */
#define REG_PDCA_ISR5              (*(RoReg  *)0x400A216CUL) /**< \brief (PDCA) Interrupt Status Register 5 */
#define REG_PDCA_MAR6              (*(RwReg  *)0x400A2180UL) /**< \brief (PDCA) Memory Address Register 6 */
#define REG_PDCA_PSR6              (*(RwReg  *)0x400A2184UL) /**< \brief (PDCA) Peripheral Select Register 6 */
#define REG_PDCA_TCR6              (*(RwReg  *)0x400A2188UL) /**< \brief (PDCA) Transfer Counter Register 6 */
#define REG_PDCA_MARR6             (*(RwReg  *)0x400A218CUL) /**< \brief (PDCA) Memory Address Reload Register 6 */
#define REG_PDCA_TCRR6             (*(RwReg  *)0x400A2190UL) /**< \brief (PDCA) Transfer Counter Reload Register 6 */
#define REG_PDCA_CR6               (*(WoReg  *)0x400A2194UL) /**< \brief (PDCA) Control Register 6 */
#define REG_PDCA_MR6               (*(RwReg  *)0x400A2198UL) /**< \brief (PDCA) Mode Register 6 */
#define REG_PDCA_SR6               (*(RoReg  *)0x400A219CUL) /**< \brief (PDCA) Status Register 6 */
#define REG_PDCA_IER6              (*(WoReg  *)0x400A21A0UL) /**< \brief (PDCA) Interrupt Enable Register 6 */
#define REG_PDCA_IDR6              (*(WoReg  *)0x400A21A4UL) /**< \brief (PDCA) Interrupt Disable Register 6 */
#define REG_PDCA_IMR6              (*(RoReg  *)0x400A21A8UL) /**< \brief (PDCA) Interrupt Mask Register 6 */
#define REG_PDCA_ISR6              (*(RoReg  *)0x400A21ACUL) /**< \brief (PDCA) Interrupt Status Register 6 */
#define REG_PDCA_MAR7              (*(RwReg  *)0x400A21C0UL) /**< \brief (PDCA) Memory Address Register 7 */
#define REG_PDCA_PSR7              (*(RwReg  *)0x400A21C4UL) /**< \brief (PDCA) Peripheral Select Register 7 */
#define REG_PDCA_TCR7              (*(RwReg  *)0x400A21C8UL) /**< \brief (PDCA) Transfer Counter Register 7 */
#define REG_PDCA_MARR7             (*(RwReg  *)0x400A21CCUL) /**< \brief (PDCA) Memory Address Reload Register 7 */
#define REG_PDCA_TCRR7             (*(RwReg  *)0x400A21D0UL) /**< \brief (PDCA) Transfer Counter Reload Register 7 */
#define REG_PDCA_CR7               (*(WoReg  *)0x400A21D4UL) /**< \brief (PDCA) Control Register 7 */
#define REG_PDCA_MR7               (*(RwReg  *)0x400A21D8UL) /**< \brief (PDCA) Mode Register 7 */
#define REG_PDCA_SR7               (*(RoReg  *)0x400A21DCUL) /**< \brief (PDCA) Status Register 7 */
#define REG_PDCA_IER7              (*(WoReg  *)0x400A21E0UL) /**< \brief (PDCA) Interrupt Enable Register 7 */
#define REG_PDCA_IDR7              (*(WoReg  *)0x400A21E4UL) /**< \brief (PDCA) Interrupt Disable Register 7 */
#define REG_PDCA_IMR7              (*(RoReg  *)0x400A21E8UL) /**< \brief (PDCA) Interrupt Mask Register 7 */
#define REG_PDCA_ISR7              (*(RoReg  *)0x400A21ECUL) /**< \brief (PDCA) Interrupt Status Register 7 */
#define REG_PDCA_MAR8              (*(RwReg  *)0x400A2200UL) /**< \brief (PDCA) Memory Address Register 8 */
#define REG_PDCA_PSR8              (*(RwReg  *)0x400A2204UL) /**< \brief (PDCA) Peripheral Select Register 8 */
#define REG_PDCA_TCR8              (*(RwReg  *)0x400A2208UL) /**< \brief (PDCA) Transfer Counter Register 8 */
#define REG_PDCA_MARR8             (*(RwReg  *)0x400A220CUL) /**< \brief (PDCA) Memory Address Reload Register 8 */
#define REG_PDCA_TCRR8             (*(RwReg  *)0x400A2210UL) /**< \brief (PDCA) Transfer Counter Reload Register 8 */
#define REG_PDCA_CR8               (*(WoReg  *)0x400A2214UL) /**< \brief (PDCA) Control Register 8 */
#define REG_PDCA_MR8               (*(RwReg  *)0x400A2218UL) /**< \brief (PDCA) Mode Register 8 */
#define REG_PDCA_SR8               (*(RoReg  *)0x400A221CUL) /**< \brief (PDCA) Status Register 8 */
#define REG_PDCA_IER8              (*(WoReg  *)0x400A2220UL) /**< \brief (PDCA) Interrupt Enable Register 8 */
#define REG_PDCA_IDR8              (*(WoReg  *)0x400A2224UL) /**< \brief (PDCA) Interrupt Disable Register 8 */
#define REG_PDCA_IMR8              (*(RoReg  *)0x400A2228UL) /**< \brief (PDCA) Interrupt Mask Register 8 */
#define REG_PDCA_ISR8              (*(RoReg  *)0x400A222CUL) /**< \brief (PDCA) Interrupt Status Register 8 */
#define REG_PDCA_MAR9              (*(RwReg  *)0x400A2240UL) /**< \brief (PDCA) Memory Address Register 9 */
#define REG_PDCA_PSR9              (*(RwReg  *)0x400A2244UL) /**< \brief (PDCA) Peripheral Select Register 9 */
#define REG_PDCA_TCR9              (*(RwReg  *)0x400A2248UL) /**< \brief (PDCA) Transfer Counter Register 9 */
#define REG_PDCA_MARR9             (*(RwReg  *)0x400A224CUL) /**< \brief (PDCA) Memory Address Reload Register 9 */
#define REG_PDCA_TCRR9             (*(RwReg  *)0x400A2250UL) /**< \brief (PDCA) Transfer Counter Reload Register 9 */
#define REG_PDCA_CR9               (*(WoReg  *)0x400A2254UL) /**< \brief (PDCA) Control Register 9 */
#define REG_PDCA_MR9               (*(RwReg  *)0x400A2258UL) /**< \brief (PDCA) Mode Register 9 */
#define REG_PDCA_SR9               (*(RoReg  *)0x400A225CUL) /**< \brief (PDCA) Status Register 9 */
#define REG_PDCA_IER9              (*(WoReg  *)0x400A2260UL) /**< \brief (PDCA) Interrupt Enable Register 9 */
#define REG_PDCA_IDR9              (*(WoReg  *)0x400A2264UL) /**< \brief (PDCA) Interrupt Disable Register 9 */
#define REG_PDCA_IMR9              (*(RoReg  *)0x400A2268UL) /**< \brief (PDCA) Interrupt Mask Register 9 */
#define REG_PDCA_ISR9              (*(RoReg  *)0x400A226CUL) /**< \brief (PDCA) Interrupt Status Register 9 */
#define REG_PDCA_MAR10             (*(RwReg  *)0x400A2280UL) /**< \brief (PDCA) Memory Address Register 10 */
#define REG_PDCA_PSR10             (*(RwReg  *)0x400A2284UL) /**< \brief (PDCA) Peripheral Select Register 10 */
#define REG_PDCA_TCR10             (*(RwReg  *)0x400A2288UL) /**< \brief (PDCA) Transfer Counter Register 10 */
#define REG_PDCA_MARR10            (*(RwReg  *)0x400A228CUL) /**< \brief (PDCA) Memory Address Reload Register 10 */
#define REG_PDCA_TCRR10            (*(RwReg  *)0x400A2290UL) /**< \brief (PDCA) Transfer Counter Reload Register 10 */
#define REG_PDCA_CR10              (*(WoReg  *)0x400A2294UL) /**< \brief (PDCA) Control Register 10 */
#define REG_PDCA_MR10              (*(RwReg  *)0x400A2298UL) /**< \brief (PDCA) Mode Register 10 */
#define REG_PDCA_SR10              (*(RoReg  *)0x400A229CUL) /**< \brief (PDCA) Status Register 10 */
#define REG_PDCA_IER10             (*(WoReg  *)0x400A22A0UL) /**< \brief (PDCA) Interrupt Enable Register 10 */
#define REG_PDCA_IDR10             (*(WoReg  *)0x400A22A4UL) /**< \brief (PDCA) Interrupt Disable Register 10 */
#define REG_PDCA_IMR10             (*(RoReg  *)0x400A22A8UL) /**< \brief (PDCA) Interrupt Mask Register 10 */
#define REG_PDCA_ISR10             (*(RoReg  *)0x400A22ACUL) /**< \brief (PDCA) Interrupt Status Register 10 */
#define REG_PDCA_MAR11             (*(RwReg  *)0x400A22C0UL) /**< \brief (PDCA) Memory Address Register 11 */
#define REG_PDCA_PSR11             (*(RwReg  *)0x400A22C4UL) /**< \brief (PDCA) Peripheral Select Register 11 */
#define REG_PDCA_TCR11             (*(RwReg  *)0x400A22C8UL) /**< \brief (PDCA) Transfer Counter Register 11 */
#define REG_PDCA_MARR11            (*(RwReg  *)0x400A22CCUL) /**< \brief (PDCA) Memory Address Reload Register 11 */
#define REG_PDCA_TCRR11            (*(RwReg  *)0x400A22D0UL) /**< \brief (PDCA) Transfer Counter Reload Register 11 */
#define REG_PDCA_CR11              (*(WoReg  *)0x400A22D4UL) /**< \brief (PDCA) Control Register 11 */
#define REG_PDCA_MR11              (*(RwReg  *)0x400A22D8UL) /**< \brief (PDCA) Mode Register 11 */
#define REG_PDCA_SR11              (*(RoReg  *)0x400A22DCUL) /**< \brief (PDCA) Status Register 11 */
#define REG_PDCA_IER11             (*(WoReg  *)0x400A22E0UL) /**< \brief (PDCA) Interrupt Enable Register 11 */
#define REG_PDCA_IDR11             (*(WoReg  *)0x400A22E4UL) /**< \brief (PDCA) Interrupt Disable Register 11 */
#define REG_PDCA_IMR11             (*(RoReg  *)0x400A22E8UL) /**< \brief (PDCA) Interrupt Mask Register 11 */
#define REG_PDCA_ISR11             (*(RoReg  *)0x400A22ECUL) /**< \brief (PDCA) Interrupt Status Register 11 */
#define REG_PDCA_MAR12             (*(RwReg  *)0x400A2300UL) /**< \brief (PDCA) Memory Address Register 12 */
#define REG_PDCA_PSR12             (*(RwReg  *)0x400A2304UL) /**< \brief (PDCA) Peripheral Select Register 12 */
#define REG_PDCA_TCR12             (*(RwReg  *)0x400A2308UL) /**< \brief (PDCA) Transfer Counter Register 12 */
#define REG_PDCA_MARR12            (*(RwReg  *)0x400A230CUL) /**< \brief (PDCA) Memory Address Reload Register 12 */
#define REG_PDCA_TCRR12            (*(RwReg  *)0x400A2310UL) /**< \brief (PDCA) Transfer Counter Reload Register 12 */
#define REG_PDCA_CR12              (*(WoReg  *)0x400A2314UL) /**< \brief (PDCA) Control Register 12 */
#define REG_PDCA_MR12              (*(RwReg  *)0x400A2318UL) /**< \brief (PDCA) Mode Register 12 */
#define REG_PDCA_SR12              (*(RoReg  *)0x400A231CUL) /**< \brief (PDCA) Status Register 12 */
#define REG_PDCA_IER12             (*(WoReg  *)0x400A2320UL) /**< \brief (PDCA) Interrupt Enable Register 12 */
#define REG_PDCA_IDR12             (*(WoReg  *)0x400A2324UL) /**< \brief (PDCA) Interrupt Disable Register 12 */
#define REG_PDCA_IMR12             (*(RoReg  *)0x400A2328UL) /**< \brief (PDCA) Interrupt Mask Register 12 */
#define REG_PDCA_ISR12             (*(RoReg  *)0x400A232CUL) /**< \brief (PDCA) Interrupt Status Register 12 */
#define REG_PDCA_MAR13             (*(RwReg  *)0x400A2340UL) /**< \brief (PDCA) Memory Address Register 13 */
#define REG_PDCA_PSR13             (*(RwReg  *)0x400A2344UL) /**< \brief (PDCA) Peripheral Select Register 13 */
#define REG_PDCA_TCR13             (*(RwReg  *)0x400A2348UL) /**< \brief (PDCA) Transfer Counter Register 13 */
#define REG_PDCA_MARR13            (*(RwReg  *)0x400A234CUL) /**< \brief (PDCA) Memory Address Reload Register 13 */
#define REG_PDCA_TCRR13            (*(RwReg  *)0x400A2350UL) /**< \brief (PDCA) Transfer Counter Reload Register 13 */
#define REG_PDCA_CR13              (*(WoReg  *)0x400A2354UL) /**< \brief (PDCA) Control Register 13 */
#define REG_PDCA_MR13              (*(RwReg  *)0x400A2358UL) /**< \brief (PDCA) Mode Register 13 */
#define REG_PDCA_SR13              (*(RoReg  *)0x400A235CUL) /**< \brief (PDCA) Status Register 13 */
#define REG_PDCA_IER13             (*(WoReg  *)0x400A2360UL) /**< \brief (PDCA) Interrupt Enable Register 13 */
#define REG_PDCA_IDR13             (*(WoReg  *)0x400A2364UL) /**< \brief (PDCA) Interrupt Disable Register 13 */
#define REG_PDCA_IMR13             (*(RoReg  *)0x400A2368UL) /**< \brief (PDCA) Interrupt Mask Register 13 */
#define REG_PDCA_ISR13             (*(RoReg  *)0x400A236CUL) /**< \brief (PDCA) Interrupt Status Register 13 */
#define REG_PDCA_MAR14             (*(RwReg  *)0x400A2380UL) /**< \brief (PDCA) Memory Address Register 14 */
#define REG_PDCA_PSR14             (*(RwReg  *)0x400A2384UL) /**< \brief (PDCA) Peripheral Select Register 14 */
#define REG_PDCA_TCR14             (*(RwReg  *)0x400A2388UL) /**< \brief (PDCA) Transfer Counter Register 14 */
#define REG_PDCA_MARR14            (*(RwReg  *)0x400A238CUL) /**< \brief (PDCA) Memory Address Reload Register 14 */
#define REG_PDCA_TCRR14            (*(RwReg  *)0x400A2390UL) /**< \brief (PDCA) Transfer Counter Reload Register 14 */
#define REG_PDCA_CR14              (*(WoReg  *)0x400A2394UL) /**< \brief (PDCA) Control Register 14 */
#define REG_PDCA_MR14              (*(RwReg  *)0x400A2398UL) /**< \brief (PDCA) Mode Register 14 */
#define REG_PDCA_SR14              (*(RoReg  *)0x400A239CUL) /**< \brief (PDCA) Status Register 14 */
#define REG_PDCA_IER14             (*(WoReg  *)0x400A23A0UL) /**< \brief (PDCA) Interrupt Enable Register 14 */
#define REG_PDCA_IDR14             (*(WoReg  *)0x400A23A4UL) /**< \brief (PDCA) Interrupt Disable Register 14 */
#define REG_PDCA_IMR14             (*(RoReg  *)0x400A23A8UL) /**< \brief (PDCA) Interrupt Mask Register 14 */
#define REG_PDCA_ISR14             (*(RoReg  *)0x400A23ACUL) /**< \brief (PDCA) Interrupt Status Register 14 */
#define REG_PDCA_MAR15             (*(RwReg  *)0x400A23C0UL) /**< \brief (PDCA) Memory Address Register 15 */
#define REG_PDCA_PSR15             (*(RwReg  *)0x400A23C4UL) /**< \brief (PDCA) Peripheral Select Register 15 */
#define REG_PDCA_TCR15             (*(RwReg  *)0x400A23C8UL) /**< \brief (PDCA) Transfer Counter Register 15 */
#define REG_PDCA_MARR15            (*(RwReg  *)0x400A23CCUL) /**< \brief (PDCA) Memory Address Reload Register 15 */
#define REG_PDCA_TCRR15            (*(RwReg  *)0x400A23D0UL) /**< \brief (PDCA) Transfer Counter Reload Register 15 */
#define REG_PDCA_CR15              (*(WoReg  *)0x400A23D4UL) /**< \brief (PDCA) Control Register 15 */
#define REG_PDCA_MR15              (*(RwReg  *)0x400A23D8UL) /**< \brief (PDCA) Mode Register 15 */
#define REG_PDCA_SR15              (*(RoReg  *)0x400A23DCUL) /**< \brief (PDCA) Status Register 15 */
#define REG_PDCA_IER15             (*(WoReg  *)0x400A23E0UL) /**< \brief (PDCA) Interrupt Enable Register 15 */
#define REG_PDCA_IDR15             (*(WoReg  *)0x400A23E4UL) /**< \brief (PDCA) Interrupt Disable Register 15 */
#define REG_PDCA_IMR15             (*(RoReg  *)0x400A23E8UL) /**< \brief (PDCA) Interrupt Mask Register 15 */
#define REG_PDCA_ISR15             (*(RoReg  *)0x400A23ECUL) /**< \brief (PDCA) Interrupt Status Register 15 */
#define REG_PDCA_PCONTROL          (*(RwReg  *)0x400A2800UL) /**< \brief (PDCA) Performance Control Register */
#define REG_PDCA_PRDATA0           (*(RoReg  *)0x400A2804UL) /**< \brief (PDCA) Channel 0 Read Data Cycles */
#define REG_PDCA_PRSTALL0          (*(RoReg  *)0x400A2808UL) /**< \brief (PDCA) Channel 0 Read Stall Cycles */
#define REG_PDCA_PRLAT0            (*(RoReg  *)0x400A280CUL) /**< \brief (PDCA) Channel 0 Read Max Latency */
#define REG_PDCA_PWDATA0           (*(RoReg  *)0x400A2810UL) /**< \brief (PDCA) Channel 0 Write Data Cycles */
#define REG_PDCA_PWSTALL0          (*(RoReg  *)0x400A2814UL) /**< \brief (PDCA) Channel 0 Write Stall Cycles */
#define REG_PDCA_PWLAT0            (*(RoReg  *)0x400A2818UL) /**< \brief (PDCA) Channel0 Write Max Latency */
#define REG_PDCA_PRDATA1           (*(RoReg  *)0x400A281CUL) /**< \brief (PDCA) Channel 1 Read Data Cycles */
#define REG_PDCA_PRSTALL1          (*(RoReg  *)0x400A2820UL) /**< \brief (PDCA) Channel Read Stall Cycles */
#define REG_PDCA_PRLAT1            (*(RoReg  *)0x400A2824UL) /**< \brief (PDCA) Channel 1 Read Max Latency */
#define REG_PDCA_PWDATA1           (*(RoReg  *)0x400A2828UL) /**< \brief (PDCA) Channel 1 Write Data Cycles */
#define REG_PDCA_PWSTALL1          (*(RoReg  *)0x400A282CUL) /**< \brief (PDCA) Channel 1 Write stall Cycles */
#define REG_PDCA_PWLAT1            (*(RoReg  *)0x400A2830UL) /**< \brief (PDCA) Channel 1 Read Max Latency */
#define REG_PDCA_VERSION           (*(RoReg  *)0x400A2834UL) /**< \brief (PDCA) Version Register */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ========== Instance parameters for PDCA peripheral ========== */
#define PDCA_CHANNEL_LENGTH         16      
#define PDCA_CLK_AHB_ID             0       
#define PDCA_MON_CH0_IMPL           0       
#define PDCA_MON_CH1_IMPL           0       

#endif /* _SAM4L_PDCA_INSTANCE_ */
